// Створення змінною за допомогою var 
//Primitive
var str = 'Hello world' // string
var num = 0.00; //може бути 253 знаки довжина //integer в іншій мові програмування
var num = 1000.123; //number //float в іншій мові програмування поділяються
var bi = BigInt('0x1ffffffffffff'); //BigInt більше число чим num
var boolean = true; //boolean
var boolean = false; //boolean
var symb1 = Symbol('id1'); //symbol
var symb2 = Symbol('id2'); //symbol
var undef = undefined; //undefined
var nul = null; //null (значення є але воно пусте)
//null не = undefined
var obj1 = {
    name: 'Ivan',
    age: 27,
    isTutor: true,
    arr: [1,2,3,4],
    company: {
        name:"Hillel",
    }
};
var obj2 = new Object();

console.log(obj1.name);
console.log(obj1['name']);

//Перетворення примітивів ( з одного типа в інший, наприклад рядок в число і навпаки)
//2 типи, явне та неявне перетворення
//unary (+ operand)
// binary + (operand + operand)
//double no (!!) if true then will be false (!)

//Оператор - символ або ключове слово яке вказує яку кіл-ть оператів потрібно виконати. 
//Операнд - це значення або обєкт над яким виконується операція. (5+3)5, 3 - операнди + оператор
//типи операторів арифметичні, порівняння, логічні, присвоєння, тернарний оператор
//арифм додавання, віднімання, множення, ділення, оператор залишку від ділення через % пишеться, 
//оператори increment, decrement (збільшує на 1 або зменшує поточне значення)
var inc = ++num;
var dec = --num;
console.log(inc);
console.log(dec);
//Оператор порібняння
console.log(inc >= dec);
//Оператор зрібняння == це нестроге зрівняння (коли потрібня порівняти два значення які дорівнюють один одному або ні)
//Строге зрівняння === крім того чи дорівнює значення ще й тип даних перевіряє
//Оператор не дорівнює це != (нестроге не дорівнює)
//Строге не дорівнює !==

//Логічні оператори
//Оператор Або || (якщо один оперант тру його повертає якщо всі false то false)
//Оператор І
//Оператор нульового злиття 
//Оператор присвоєння це просто = дорівнює, ще є присвоєння з операцією

var a = 42;
a = a + 2;
a = a - 2;
a = a * 2;
a = a / 2;

console.log(a);

//Тернарний оператор
if (a == 42) {
    console.log('equal')
} else {
    console.log('not equal')
}